# running in Arith/src/
read -formal -sv Arith.sv
prep -top Arith
opt_merge -share_all
memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
